MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1025DAL176/mcu.h
extern volatile __U4MODEbits_t U4MODEbits __asm__ ("U4MODE") __attribute__((section("sfrs"), address(0xBF822600)));
extern volatile uint32_t        U4MODECLR __attribute__((section("sfrs"),address(0xBF822604)));
extern volatile uint32_t        U4MODESET __attribute__((section("sfrs"),address(0xBF822608)));
extern volatile uint32_t        U4MODEINV __attribute__((section("sfrs"),address(0xBF82260C)));
#define U4STA U4STA
extern volatile uint32_t   U4STA __attribute__((section("sfrs"), address(0xBF822610)));
typedef union {
  struct {
    uint32_t URXDA:1;
    uint32_t OERR:1;
    uint32_t FERR:1;
    uint32_t PERR:1;
    uint32_t RIDLE:1;
    uint32_t ADDEN:1;
    uint32_t URXISEL:2;
    uint32_t TRMT:1;
    uint32_t UTXBF:1;
    uint32_t UTXEN:1;
    uint32_t UTXBRK:1;
    uint32_t URXEN:1;
    uint32_t UTXINV:1;
    uint32_t UTXISEL:2;
    uint32_t ADDR:8;
    uint32_t MASK:8;
  };
  struct {
    uint32_t :6;
    uint32_t URXISEL0:1;
    uint32_t URXISEL1:1;
    uint32_t :6;
    uint32_t UTXISEL0:1;
    uint32_t UTXISEL1:1;
  };
  struct {
    uint32_t :14;
    uint32_t UTXSEL:2;
  };
  struct {
    uint32_t w:32;
  };
} __U4STAbits_t;
extern volatile __U4STAbits_t U4STAbits __asm__ ("U4STA") __attribute__((section("sfrs"), address(0xBF822610)));
extern volatile uint32_t        U4STACLR __attribute__((section("sfrs"),address(0xBF822614)));
extern volatile uint32_t        U4STASET __attribute__((section("sfrs"),address(0xBF822618)));
extern volatile uint32_t        U4STAINV __attribute__((section("sfrs"),address(0xBF82261C)));
#define U4TXREG U4TXREG
extern volatile uint32_t   U4TXREG __attribute__((section("sfrs"), address(0xBF822620)));
#define U4RXREG U4RXREG
extern volatile uint32_t   U4RXREG __attribute__((section("sfrs"), address(0xBF822630)));
#define U4BRG U4BRG
extern volatile uint32_t   U4BRG __attribute__((section("sfrs"), address(0xBF822640)));
typedef struct {
  uint32_t BRG:20;
} __U4BRGbits_t;
extern volatile __U4BRGbits_t U4BRGbits __asm__ ("U4BRG") __attribute__((section("sfrs"), address(0xBF822640)));
extern volatile uint32_t        U4BRGCLR __attribute__((section("sfrs"),address(0xBF822644)));
extern volatile uint32_t        U4BRGSET __attribute__((section("sfrs"),address(0xBF822648)));
extern volatile uint32_t        U4BRGINV __attribute__((section("sfrs"),address(0xBF82264C)));
#define U5MODE U5MODE
extern volatile uint32_t   U5MODE __attribute__((section("sfrs"), address(0xBF822800)));
typedef union {
  struct {
    uint32_t STSEL:1;
    uint32_t PDSEL:2;
    uint32_t BRGH:1;
    uint32_t RXINV:1;
    uint32_t ABAUD:1;
    uint32_t LPBACK:1;
    uint32_t WAKE:1;
    uint32_t UEN:2;
    uint32_t :1;
    uint32_t RTSMD:1;
    uint32_t IREN:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t OVFDIS:1;
    uint32_t CLKSEL:2;
    uint32_t :3;
    uint32_t ACTIVE:1;
    uint32_t SLPEN:1;
  };
  struct {
    uint32_t :16;
    uint32_t RUNOVF:1;
  };
  struct {
    uint32_t :1;
    uint32_t PDSEL0:1;
    uint32_t PDSEL1:1;
    uint32_t :5;
    uint32_t UEN0:1;
    uint32_t UEN1:1;
  };
  struct {
    uint32_t :13;
    uint32_t USIDL:1;
    uint32_t :1;
    uint32_t UARTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __U5MODEbits_t;
extern volatile __U5MODEbits_t U5MODEbits __asm__ ("U5MODE") __attribute__((section("sfrs"), address(0xBF822800)));
extern volatile uint32_t        U5MODECLR __attribute__((section("sfrs"),address(0xBF822804)));
extern volatile uint32_t        U5MODESET __attribute__((section("sfrs"),address(0xBF822808)));
extern volatile uint32_t        U5MODEINV __attribute__((section("sfrs"),address(0xBF82280C)));
#define U5STA U5STA
extern volatile uint32_t   U5STA __attribute__((section("sfrs"), address(0xBF822810)));
typedef union {
  struct {
    uint32_t URXDA:1;
    uint32_t OERR:1;
    uint32_t FERR:1;
    uint32_t PERR:1;
    uint32_t RIDLE:1;
    uint32_t ADDEN:1;
    uint32_t URXISEL:2;
    uint32_t TRMT:1;
    uint32_t UTXBF:1;
    uint32_t UTXEN:1;
    uint32_t UTXBRK:1;
    uint32_t URXEN:1;
    uint32_t UTXINV:1;
    uint32_t UTXISEL:2;
    uint32_t ADDR:8;
    uint32_t MASK:8;
  };
  struct {
    uint32_t :6;
    uint32_t URXISEL0:1;
    uint32_t URXISEL1:1;
    uint32_t :6;
    uint32_t UTXISEL0:1;
    uint32_t UTXISEL1:1;
  };
  struct {
    uint32_t :14;
    uint32_t UTXSEL:2;
  };
  struct {
    uint32_t w:32;
  };
} __U5STAbits_t;
extern volatile __U5STAbits_t U5STAbits __asm__ ("U5STA") __attribute__((section("sfrs"), address(0xBF822810)));
extern volatile uint32_t        U5STACLR __attribute__((section("sfrs"),address(0xBF822814)));
extern volatile uint32_t        U5STASET __attribute__((section("sfrs"),address(0xBF822818)));
extern volatile uint32_t        U5STAINV __attribute__((section("sfrs"),address(0xBF82281C)));
#define U5TXREG U5TXREG
extern volatile uint32_t   U5TXREG __attribute__((section("sfrs"), address(0xBF822820)));
#define U5RXREG U5RXREG
extern volatile uint32_t   U5RXREG __attribute__((section("sfrs"), address(0xBF822830)));
#define U5BRG U5BRG
extern volatile uint32_t   U5BRG __attribute__((section("sfrs"), address(0xBF822840)));
typedef struct {
  uint32_t BRG:20;
} __U5BRGbits_t;
extern volatile __U5BRGbits_t U5BRGbits __asm__ ("U5BRG") __attribute__((section("sfrs"), address(0xBF822840)));
extern volatile uint32_t        U5BRGCLR __attribute__((section("sfrs"),address(0xBF822844)));
extern volatile uint32_t        U5BRGSET __attribute__((section("sfrs"),address(0xBF822848)));
extern volatile uint32_t        U5BRGINV __attribute__((section("sfrs"),address(0xBF82284C)));
#define U6MODE U6MODE
extern volatile uint32_t   U6MODE __attribute__((section("sfrs"), address(0xBF822A00)));
typedef union {
  struct {
    uint32_t STSEL:1;
    uint32_t PDSEL:2;
    uint32_t BRGH:1;
    uint32_t RXINV:1;
    uint32_t ABAUD:1;
    uint32_t LPBACK:1;
    uint32_t WAKE:1;
    uint32_t UEN:2;
    uint32_t :1;
    uint32_t RTSMD:1;
    uint32_t IREN:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t OVFDIS:1;
    uint32_t CLKSEL:2;
    uint32_t :3;
    uint32_t ACTIVE:1;
    uint32_t SLPEN:1;
  };
  struct {
    uint32_t :16;
    uint32_t RUNOVF:1;
  };
  struct {
    uint32_t :1;
    uint32_t PDSEL0:1;
    uint32_t PDSEL1:1;
    uint32_t :5;
    uint32_t UEN0:1;
    uint32_t UEN1:1;
  };
  struct {
    uint32_t :13;
    uint32_t USIDL:1;
    uint32_t :1;
    uint32_t UARTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __U6MODEbits_t;
extern volatile __U6MODEbits_t U6MODEbits __asm__ ("U6MODE") __attribute__((section("sfrs"), address(0xBF822A00)));
extern volatile uint32_t        U6MODECLR __attribute__((section("sfrs"),address(0xBF822A04)));
extern volatile uint32_t        U6MODESET __attribute__((section("sfrs"),address(0xBF822A08)));
extern volatile uint32_t        U6MODEINV __attribute__((section("sfrs"),address(0xBF822A0C)));
#define U6STA U6STA
extern volatile uint32_t   U6STA __attribute__((section("sfrs"), address(0xBF822A10)));
typedef union {
  struct {
    uint32_t URXDA:1;
    uint32_t OERR:1;
    uint32_t FERR:1;
    uint32_t PERR:1;
    uint32_t RIDLE:1;
    uint32_t ADDEN:1;
    uint32_t URXISEL:2;
    uint32_t TRMT:1;
    uint32_t UTXBF:1;
    uint32_t UTXEN:1;
    uint32_t UTXBRK:1;
    uint32_t URXEN:1;
    uint32_t UTXINV:1;
    uint32_t UTXISEL:2;
    uint32_t ADDR:8;
    uint32_t MASK:8;
  };
  struct {
    uint32_t :6;
    uint32_t URXISEL0:1;
    uint32_t URXISEL1:1;
    uint32_t :6;
    uint32_t UTXISEL0:1;
    uint32_t UTXISEL1:1;
  };
  struct {
    uint32_t :14;
    uint32_t UTXSEL:2;
  };
  struct {
    uint32_t w:32;
  };
} __U6STAbits_t;
extern volatile __U6STAbits_t U6STAbits __asm__ ("U6STA") __attribute__((section("sfrs"), address(0xBF822A10)));
extern volatile uint32_t        U6STACLR __attribute__((section("sfrs"),address(0xBF822A14)));
extern volatile uint32_t        U6STASET __attribute__((section("sfrs"),address(0xBF822A18)));
extern volatile uint32_t        U6STAINV __attribute__((section("sfrs"),address(0xBF822A1C)));
#define U6TXREG U6TXREG
extern volatile uint32_t   U6TXREG __attribute__((section("sfrs"), address(0xBF822A20)));
#define U6RXREG U6RXREG
extern volatile uint32_t   U6RXREG __attribute__((section("sfrs"), address(0xBF822A30)));
#define U6BRG U6BRG
extern volatile uint32_t   U6BRG __attribute__((section("sfrs"), address(0xBF822A40)));
typedef struct {
  uint32_t BRG:20;
} __U6BRGbits_t;
extern volatile __U6BRGbits_t U6BRGbits __asm__ ("U6BRG") __attribute__((section("sfrs"), address(0xBF822A40)));
extern volatile uint32_t        U6BRGCLR __attribute__((section("sfrs"),address(0xBF822A44)));
extern volatile uint32_t        U6BRGSET __attribute__((section("sfrs"),address(0xBF822A48)));
extern volatile uint32_t        U6BRGINV __attribute__((section("sfrs"),address(0xBF822A4C)));
#define PMCON PMCON
extern volatile uint32_t   PMCON __attribute__((section("sfrs"), address(0xBF82E000)));
typedef union {
  struct {
    uint32_t RDSP:1;
    uint32_t WRSP:1;
    uint32_t :1;
    uint32_t CS1P:1;
    uint32_t CS2P:1;
    uint32_t ALP:1;
    uint32_t CSF:2;
    uint32_t PTRDEN:1;
    uint32_t PTWREN:1;
    uint32_t PMPTTL:1;
    uint32_t ADRMUX:2;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t :1;
    uint32_t DUALBUF:1;
    uint32_t :5;
    uint32_t RDSTART:1;
  };
  struct {
    uint32_t :6;
    uint32_t CSF0:1;
    uint32_t CSF1:1;
    uint32_t :3;
    uint32_t ADRMUX0:1;
    uint32_t ADRMUX1:1;
  };
  struct {
    uint32_t :13;
    uint32_t PSIDL:1;
    uint32_t :1;
    uint32_t PMPEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __PMCONbits_t;
extern volatile __PMCONbits_t PMCONbits __asm__ ("PMCON") __attribute__((section("sfrs"), address(0xBF82E000)));
extern volatile uint32_t        PMCONCLR __attribute__((section("sfrs"),address(0xBF82E004)));
extern volatile uint32_t        PMCONSET __attribute__((section("sfrs"),address(0xBF82E008)));
extern volatile uint32_t        PMCONINV __attribute__((section("sfrs"),address(0xBF82E00C)));
#define PMMODE PMMODE
extern volatile uint32_t   PMMODE __attribute__((section("sfrs"), address(0xBF82E010)));
typedef union {
  struct {
    uint32_t WAITE:2;
    uint32_t WAITM:4;
    uint32_t WAITB:2;
    uint32_t MODE:2;
    uint32_t MODE16:1;
    uint32_t INCM:2;
    uint32_t IRQM:2;
    uint32_t BUSY:1;
  };
  struct {
    uint32_t WAITE0:1;
    uint32_t WAITE1:1;
    uint32_t WAITM0:1;
    uint32_t WAITM1:1;
    uint32_t WAITM2:1;
    uint32_t WAITM3:1;
    uint32_t WAITB0:1;
    uint32_t WAITB1:1;
    uint32_t MODE0:1;
    uint32_t MODE1:1;
    uint32_t :1;
    uint32_t INCM0:1;
    uint32_t INCM1:1;
    uint32_t IRQM0:1;
    uint32_t IRQM1:1;
  };
  struct {
    uint32_t w:32;
  };
} __PMMODEbits_t;
extern volatile __PMMODEbits_t PMMODEbits __asm__ ("PMMODE") __attribute__((section("sfrs"), address(0xBF82E010)));
extern volatile uint32_t        PMMODECLR __attribute__((section("sfrs"),address(0xBF82E014)));
extern volatile uint32_t        PMMODESET __attribute__((section("sfrs"),address(0xBF82E018)));
extern volatile uint32_t        PMMODEINV __attribute__((section("sfrs"),address(0xBF82E01C)));
#define PMADDR PMADDR
extern volatile uint32_t   PMADDR __attribute__((section("sfrs"), address(0xBF82E020)));
typedef union {
  struct {
    uint32_t ADDR:14;
    uint32_t ADDR14:1;
    uint32_t ADDR15:1;
  };
  struct {
    uint32_t :14;
    uint32_t CS:2;
  };
  struct {
    uint32_t :14;
    uint32_t CS1:1;
    uint32_t CS2:1;
  };
  struct {
    uint32_t w:32;
  };
} __PMADDRbits_t;
extern volatile __PMADDRbits_t PMADDRbits __asm__ ("PMADDR") __attribute__((section("sfrs"), address(0xBF82E020)));
extern volatile uint32_t        PMADDRCLR __attribute__((section("sfrs"),address(0xBF82E024)));
extern volatile uint32_t        PMADDRSET __attribute__((section("sfrs"),address(0xBF82E028)));
extern volatile uint32_t        PMADDRINV __attribute__((section("sfrs"),address(0xBF82E02C)));
#define PMDOUT PMDOUT
extern volatile uint32_t   PMDOUT __attribute__((section("sfrs"), address(0xBF82E030)));
typedef union {
  struct {
    uint32_t DATAOUT:32;
  };
  struct {
    uint32_t w:32;
  };
} __PMDOUTbits_t;
extern volatile __PMDOUTbits_t PMDOUTbits __asm__ ("PMDOUT") __attribute__((section("sfrs"), address(0xBF82E030)));
extern volatile uint32_t        PMDOUTCLR __attribute__((section("sfrs"),address(0xBF82E034)));
extern volatile uint32_t        PMDOUTSET __attribute__((section("sfrs"),address(0xBF82E038)));
extern volatile uint32_t        PMDOUTINV __attribute__((section("sfrs"),address(0xBF82E03C)));
#define PMDIN PMDIN
extern volatile uint32_t   PMDIN __attribute__((section("sfrs"), address(0xBF82E040)));
typedef union {
  struct {
    uint32_t DATAIN:32;
  };
  struct {
    uint32_t w:32;
  };
} __PMDINbits_t;
extern volatile __PMDINbits_t PMDINbits __asm__ ("PMDIN") __attribute__((section("sfrs"), address(0xBF82E040)));
extern volatile uint32_t        PMDINCLR __attribute__((section("sfrs"),address(0xBF82E044)));
extern volatile uint32_t        PMDINSET __attribute__((section("sfrs"),address(0xBF82E048)));
extern volatile uint32_t        PMDININV __attribute__((section("sfrs"),address(0xBF82E04C)));
#define PMAEN PMAEN
extern volatile uint32_t   PMAEN __attribute__((section("sfrs"), address(0xBF82E050)));
typedef union {
  struct {
    uint32_t PTEN:24;
  };
  struct {
    uint32_t w:32;
  };
} __PMAENbits_t;
